junke365/plc-studio/smart-plc-studio/packages/runtime/examples/stm32/main.c
/**
 * main.c — STM32F407 PLC 运行时主程序
 *
 * 硬件配置:
 *   MCU:     STM32F407VG (Cortex-M4F @ 168MHz)
 *   HSE:     8MHz 晶振
 *   LED:     PA5 (心跳指示)
 *   UART1:   PA9(TX)/PA10(RX) — Modbus RTU
 *   调试串口 (USART6): PC6(TX)/PD15(RX) — 调试输出 (115200)
 *   ADC1:    PA0(AI0), PA1(AI1)
 *   TIM3:    PA6(PWM0) — PWM 输出
 *   TIM6:    微秒延时基准
 *   SPI1:    PA5(SCK)/PA6(MISO)/PA7(MOSI)/PA4(CS) — I/O 扩展
 *   5轴 CNC 步进电机:
 *     X: STEP=PB4, DIR=PB5, EN=PB6
 *     Y: STEP=PB7, DIR=PB8, EN=PB9
 *     Z: STEP=PB10, DIR=PB11, EN=PB12
 *     A: STEP=PE0, DIR=PE1, EN=PE2
 *     B: STEP=PE3, DIR=PE4, EN=PE5
 *
 * 构建:
 *   cmake -B build-stm32 -DPLATFORM=stm32 ^
 *     -DSTM32_HAL_DIR=path/to/STM32Cube_FW_F4 ^
 *     -DCMAKE_TOOLCHAIN_FILE=cmake/stm32_gcc.cmake
 *   cmake --build build-stm32
 */

#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "plc_runtime.h"
#include "plc_debug_protocol.h"
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"

/* ========== STM32 HAL ========== */

#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal_gpio.h"
#include "stm32f4xx_hal_uart.h"
#include "stm32f4xx_hal_adc.h"
#include "stm32f4xx_hal_dac.h"
#include "stm32f4xx_hal_tim.h"
#include "stm32f4xx_hal_spi.h"
#include "stm32f4xx_hal_rcc.h"

/* ========== HAL 句柄 ========== */

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
ADC_HandleTypeDef  hadc1;
DAC_HandleTypeDef  hdac;
TIM_HandleTypeDef  htim3;
TIM_HandleTypeDef  htim6;
SPI_HandleTypeDef  hspi1;

/* ========== 5轴 CNC 步进电机引脚定义 ========== */
/*
 * 每个轴 3 个控制信号: STEP(步进脉冲), DIR(方向), ENABLE(使能)
 * 引脚编码格式: (GPIO端口索引 << 4) | 引脚号
 * 端口索引: GPIOA=0, GPIOB=1, GPIOC=2, GPIOD=3, GPIOE=4
 */

/* X 轴 */
#define AXIS_X_STEP_GPIO  GPIOB
#define AXIS_X_STEP_PIN   GPIO_PIN_4
#define AXIS_X_DIR_GPIO   GPIOB
#define AXIS_X_DIR_PIN    GPIO_PIN_5
#define AXIS_X_EN_GPIO    GPIOB
#define AXIS_X_EN_PIN     GPIO_PIN_6
#define AXIS_X_STEP_ADDR  20   /* (1<<4)|4 */
#define AXIS_X_DIR_ADDR   21   /* (1<<4)|5 */
#define AXIS_X_EN_ADDR    22   /* (1<<4)|6 */

/* Y 轴 */
#define AXIS_Y_STEP_GPIO  GPIOB
#define AXIS_Y_STEP_PIN   GPIO_PIN_7
#define AXIS_Y_DIR_GPIO   GPIOB
#define AXIS_Y_DIR_PIN    GPIO_PIN_8
#define AXIS_Y_EN_GPIO    GPIOB
#define AXIS_Y_EN_PIN     GPIO_PIN_9
#define AXIS_Y_STEP_ADDR  23   /* (1<<4)|7 */
#define AXIS_Y_DIR_ADDR   24   /* (1<<4)|8 */
#define AXIS_Y_EN_ADDR    25   /* (1<<4)|9 */

/* Z 轴 */
#define AXIS_Z_STEP_GPIO  GPIOB
#define AXIS_Z_STEP_PIN   GPIO_PIN_10
#define AXIS_Z_DIR_GPIO   GPIOB
#define AXIS_Z_DIR_PIN    GPIO_PIN_11
#define AXIS_Z_EN_GPIO    GPIOB
#define AXIS_Z_EN_PIN     GPIO_PIN_12
#define AXIS_Z_STEP_ADDR  26   /* (1<<4)|10 */
#define AXIS_Z_DIR_ADDR   27   /* (1<<4)|11 */
#define AXIS_Z_EN_ADDR    28   /* (1<<4)|12 */

/* A 轴 (旋转轴) */
#define AXIS_A_STEP_GPIO  GPIOE
#define AXIS_A_STEP_PIN   GPIO_PIN_0
#define AXIS_A_DIR_GPIO   GPIOE
#define AXIS_A_DIR_PIN    GPIO_PIN_1
#define AXIS_A_EN_GPIO    GPIOE
#define AXIS_A_EN_PIN     GPIO_PIN_2
#define AXIS_A_STEP_ADDR  64   /* (4<<4)|0 */
#define AXIS_A_DIR_ADDR   65   /* (4<<4)|1 */
#define AXIS_A_EN_ADDR    66   /* (4<<4)|2 */

/* B 轴 (旋转轴) */
#define AXIS_B_STEP_GPIO  GPIOE
#define AXIS_B_STEP_PIN   GPIO_PIN_3
#define AXIS_B_DIR_GPIO   GPIOE
#define AXIS_B_DIR_PIN    GPIO_PIN_4
#define AXIS_B_EN_GPIO    GPIOE
#define AXIS_B_EN_PIN     GPIO_PIN_5
#define AXIS_B_STEP_ADDR  67   /* (4<<4)|3 */
#define AXIS_B_DIR_ADDR   68   /* (4<<4)|4 */
#define AXIS_B_EN_ADDR    69   /* (4<<4)|5 */

/* ========== 外设初始化函数声明 ========== */

static void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART6_DBG_UART_Init(void);
static void MX_ADC1_Init(void);
static void MX_DAC_Init(void);
static void MX_TIM3_PWM_Init(void);
static void MX_TIM6_Init(void);
static void MX_SPI1_Init(void);

/* ========== 系统时钟配置 ========== */

static void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /* HSI(16MHz) → PLL: 16/8 × 168 / 2 = 168MHz
   * 用 HSI 作为 PLL 源，不依赖外部晶振频率，任何板子都能稳定启动。 */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 168;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  HAL_RCC_OscConfig(&RCC_OscInitStruct);

  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
    | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;
  HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5);

  /* 使能 TIM 时钟 */
  __HAL_RCC_TIM6_CLK_ENABLE();
  __HAL_RCC_TIM3_CLK_ENABLE();
}

/* ========== GPIO 初始化 ========== */

static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};

  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOE_CLK_ENABLE();

  /* PA5: LED 心跳输出 */
  GPIO_InitStruct.Pin = GPIO_PIN_5;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /* PB0-PB3: 数字量输入（外部传感器） */
  GPIO_InitStruct.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /* PC2-PC3: 数字量输出（继电器，高电平=开） */
  GPIO_InitStruct.Pin = GPIO_PIN_2 | GPIO_PIN_3;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_2 | GPIO_PIN_3, GPIO_PIN_RESET);

  /* PA4: SPI1 CS 输出 */
  GPIO_InitStruct.Pin = GPIO_PIN_4;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);

  /* ===== 5轴 CNC 步进电机控制引脚 ===== */
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;

  /* X 轴: PB4(STEP), PB5(DIR), PB6(EN) */
  GPIO_InitStruct.Pin = GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6, GPIO_PIN_RESET);

  /* Y 轴: PB7(STEP), PB8(DIR), PB9(EN) */
  GPIO_InitStruct.Pin = GPIO_PIN_7 | GPIO_PIN_8 | GPIO_PIN_9;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_7 | GPIO_PIN_8 | GPIO_PIN_9, GPIO_PIN_RESET);

