junke365/plc-studio/smart-plc-studio/packages/runtime/examples/stm32/main.c
        if (sent_len > 0) {
          HAL_UART_Transmit(&huart2, tx_buf, sent_len, 100);
        }

        /* 移除已处理的帧 */
        rx_pos -= frame_len;
        memmove(rx_buf, rx_buf + frame_len, rx_pos);
      }
    }

    vTaskDelay(pdMS_TO_TICKS(5));
  }
}

/* ========== main ========== */

/* 诊断用: main 执行进度标记 (0=未启动, 9=调度器返回异常) */
volatile uint32_t g_stage = 0;
/* xTaskCreate 返回值: 0=成功, 1=无法分配内存 */
volatile uint32_t g_tc_res[4] = {0};
/* 启动调度器前 FreeRTOS 堆剩余字节 */
volatile uint32_t g_heap_free = 0;

int main(void)
{
  g_stage = 1;

  /* HAL 库初始化 */
  HAL_Init();
  g_stage = 2;

  /* 系统时钟 168MHz */
  SystemClock_Config();

  /* 关键: SystemClock_Config 内部的 HAL_RCC_ClockConfig() 会调用
   * HAL_InitTick() (stm32f4xx_hal_rcc.c:722) 重新使能 SysTick 中断。
   * 此时 FreeRTOS 尚未启动，若 SysTick 中断触发会进入向量表中已改向
   * FreeRTOS 的 xPortSysTickHandler → xTaskIncrementTick 访问未初始化
   * 的任务列表 → HardFault。必须立即关闭，直到 vTaskStartScheduler。 */
  SysTick->CTRL &= ~SysTick_CTRL_TICKINT_Msk;
  g_stage = 3;

  /* 外设初始化 */
  MX_GPIO_Init();
  MX_USART1_UART_Init();
  MX_USART6_DBG_UART_Init();
  MX_ADC1_Init();
  MX_DAC_Init();
  MX_TIM3_PWM_Init();
  MX_TIM6_Init();
  MX_SPI1_Init();
  g_stage = 4;

  /* 启动 TIM6（μs 基准） */
  HAL_TIM_Base_Start(&htim6);
  g_stage = 5;

  printf("\n========================================\n");
  printf(" Smart PLC Runtime — STM32F407\n");
  printf(" SYSCLK=%luMHz, %luKB Flash, %luKB RAM\n",
         HAL_RCC_GetSysClockFreq() / 1000000UL, 1024UL, 192UL);
  printf("========================================\n\n");

  /* ===== PLC 运行时初始化 ===== */

  plc_runtime_init(&g_runtime);

  /* 注册变量 */
  PlcVarTable* vt = plc_runtime_get_var_table(&g_runtime);
  plc_var_register(vt, "sensor_di_0", VAR_TYPE_BOOL, VAR_ATTR_INPUT,
                   sizeof(plc_bool), "数字量输入 0 (PB0)");
  plc_var_register(vt, "sensor_di_1", VAR_TYPE_BOOL, VAR_ATTR_INPUT,
                   sizeof(plc_bool), "数字量输入 1 (PB1)");
  plc_var_register(vt, "adc_ch_0", VAR_TYPE_UINT, VAR_ATTR_INPUT,
                   sizeof(plc_uint), "模拟量输入 0 (PA0, 12bit)");
  plc_var_register(vt, "relay_0", VAR_TYPE_BOOL, VAR_ATTR_OUTPUT,
                   sizeof(plc_bool), "继电器 0 (PC2, 高电平开)");
  plc_var_register(vt, "relay_1", VAR_TYPE_BOOL, VAR_ATTR_OUTPUT,
                   sizeof(plc_bool), "继电器 1 (PC3, 高电平开)");
  plc_var_register(vt, "pwm_0", VAR_TYPE_UINT, VAR_ATTR_OUTPUT,
                   sizeof(plc_uint), "PWM 输出 0 (PA6)");

  printf("[PLC] 已注册 %u 个变量\n", plc_var_count(vt));

  /* 配置 I/O 映射 */
  PlcIoConfig* io = plc_runtime_get_io_config(&g_runtime);
  plc_io_register(io, IO_TYPE_DI,  "DI_0",   "sensor_di_0", 0x10);
  plc_io_register(io, IO_TYPE_DI,  "DI_1",   "sensor_di_1", 0x11);
  plc_io_register(io, IO_TYPE_AI,  "AI_0",   "adc_ch_0",    0x00);
  plc_io_register(io, IO_TYPE_DO,  "DO_0",   "relay_0",     0x22); /* PC2 */
  plc_io_register(io, IO_TYPE_DO,  "DO_1",   "relay_1",     0x23); /* PC3 */
  plc_io_register(io, IO_TYPE_PWM, "PWM_0",  "pwm_0",       0x30);

  /* 绑定 I/O ↔ 变量 */
  for (uint16_t i = 0; i < io->channel_count; i++) {
    plc_io_bind(io, i, vt);
    printf("[PLC]   I/O %s → %s\n", io->channels[i].name, io->channels[i].var_name);
  }

  /* 加载并启动运行时 */
  plc_runtime_load(&g_runtime);
  plc_runtime_start(&g_runtime);

  printf("[PLC] 运行时已启动 (state=%d)\n", plc_runtime_get_state(&g_runtime));

  /* ===== 创建 FreeRTOS 任务 ===== */

  /* 任务栈均 ≥1536 字(6KB): 完整版 newlib printf 单次需 ~4.5KB 栈,
   * 栈过小会在任务内溢出, 破坏 heap 导致随机崩溃 */
  g_tc_res[0] = xTaskCreate(plc_scan_task, "PLC_Scan", 1536, &g_runtime,
              configMAX_PRIORITIES - 1, NULL);
  g_tc_res[1] = xTaskCreate(comm_task, "Comm", 1536, &g_runtime,
              configMAX_PRIORITIES - 2, NULL);
  g_tc_res[2] = xTaskCreate(debug_comm_task, "DbgComm", 2048, &g_runtime,
              configMAX_PRIORITIES - 2, NULL);
  g_tc_res[3] = xTaskCreate(led_task, "LED", 1536, NULL, 1, NULL);

  printf("[STM32] FreeRTOS 任务已创建 (4 tasks), 启动调度器...\n");

  /* 再次关闭 SysTick 中断：SystemClock_Config() 内部的
   * HAL_RCC_ClockConfig() 会调用 HAL_InitTick()（stm32f4xx_hal_rcc.c:722）
   * 重新使能 SysTick，因此上面 HAL_Init() 后的那次关闭被覆盖。
   * FreeRTOS 的 vPortSetupTimerInterrupt 启动调度器时才会重新使能。 */
  SysTick->CTRL &= ~SysTick_CTRL_TICKINT_Msk;

  /* 修复 SysTick/PendSV 中断优先级:
   * HAL_InitTick() 会把 SysTick 优先级设为 0xF0(最低),
   * 而 FreeRTOS port.c 用 "|=" 写优先级, 0xF0|=0x70 仍是 0xF0,
   * 导致 SysTick(0xF0) 与 PendSV(0x70) 优先级不一致,
   * PendSV 可抢占 SysTick, 破坏 FreeRTOS 时序假设 → INVPC 崩溃。
   * 必须在启动调度器前显式赋值为 configKERNEL_INTERRUPT_PRIORITY。 */
  NVIC_SetPriority(SysTick_IRQn, configKERNEL_INTERRUPT_PRIORITY);
  NVIC_SetPriority(PendSV_IRQn, configKERNEL_INTERRUPT_PRIORITY);
  g_stage = 7;

  g_heap_free = xPortGetFreeHeapSize();

  /* 启动 FreeRTOS 调度器（永不返回） */
  vTaskStartScheduler();

  /* 异常: 调度器不应返回 */
  g_stage = 8;
  printf("[FATAL] 调度器异常返回!\n");
  for (;;);
}

/* ========== FreeRTOS 钩子 ========== */

void vApplicationStackOverflowHook(TaskHandle_t xTask, char* pcTaskName)
{
  (void)xTask;
  printf("[FATAL] 栈溢出! 任务: %s\n", pcTaskName);
  taskDISABLE_INTERRUPTS();
  for (;;);
}

void vApplicationMallocFailedHook(void)
{
  printf("[FATAL] 内存分配失败!\n");
  taskDISABLE_INTERRUPTS();
  for (;;);
}

void vApplicationIdleHook(void)
{
  /* 空闲时进入低功耗（可选） */
}
